Repository: StatCan/jupyter-apis
Catalog: frontend/jupyter/i18n/*/messages.*.xlf
Languages: fr

source: Status
fr: Statut

source: Last Transition Time
fr: Dernière heure de transition

source: Reason
fr: Raison

source: Resources not available
fr: Ressources non disponibles

source: No value to copy to clipboard
fr: Aucune valeur à copier dans le presse-papiers

source: Content copied to clipboard
fr: Contenu copié dans le presse-papiers

source: Hide this section
fr: Masquer cette section

source: Advanced Options
fr: Options avancées

source: Name
fr: Nom

source: Namespace
fr: Espace de noms

source: Cannot be less than {{ min }}..
fr: Ne peut pas être moins que {{ min }}..

source: *The cluster admin has disabled setting this section!
fr: *L'administrateur de la grappe a désactivé le paramètre de cette section !

source: CREATE
fr: CRÉER

source: CREATING
fr: EN CRÉATION

source: CANCEL
fr: ANNULER

source: Edit
fr: Modifier

source: and submit YAML
fr: et soumettre le YAML

source: Can not update control with value null
fr: Impossible de mettre à jour le contrôle avec la valeur nulle

source: Name must consist of lowercase alphanumeric characters or '-', and must start and end with an alphanumeric character
fr: Le nom doit être composé de caractères alphanumériques minuscules ou « - », et doit commencer et se terminer par un caractère alphanumérique

source: Name must consist of lowercase alphanumeric characters or '-', start with an alphabetic character, and end with an alphanumeric character.
fr: Le nom doit être des caractères minuscules alphanumériques ou '-' et doit commencer et terminer par des caractères alphanumériques.

source: Invalid volume size: Should be an integer, or integer followed by a valid unit
fr: Taille du volume invalide : doit être un entier, ou un entier suivi d'une unité valide

source: Invalid memory size: Should be an integer, or fixed-point integer followed by a valid unit
fr: Taille de mémoire invalide : doit être un entier, ou un entier à virgule fixe suivi d'une unité valide

source: Invalid cpu limit: Should be a fixed-point integer or an integer followed by 'm'
fr: Limite de CPU non valide : doit être une valeur à virgule fixe entier ou entier suivi de 'm'

source: already exists
fr: existe déjà

source: Name is too long
fr: Le nom est trop long

source: Name cannot be empty
fr: Nom ne peut pas être vide

source: Create a filter query by entering either a property name or just a value to narrow your results.
fr: Créez une requête de filtre en saisissant soit un nom de propriété, soit simplement une valeur pour affiner vos résultats.

source: Example:
fr: Exemple :

source: Name: filterValue
fr: Nom: valeurFiltre

source: Filter empty values by entering double quotes:
fr: Filtrez les valeurs vides en saisissant des guillemets :

source: Name: ""
fr: Nom: ""

source: Status
fr: Statut

source: Filter based on the objects' status, by using:
fr: Filtrez en fonction du statut des objets, en utilisant :

source: The value shown in the tooltip
fr: La valeur affichée dans l'info-bulle

source: The status types (i.e. ating, stoppedready, waiting, warning, error, unavailable, uninitialized, terminating, stopped</li> </ul> </ng-template> <ng-template [ngIf]="showDate"> <mat-divid)
fr: Les types de statut (c'est-à-dire <i>ready, waiting, warning, error, unavailable, uninitialized, terminating, stopped</li> </ul> </ng-template> <ng-template [ngIf]="showDate"> <mat-divid)

source: Filter timestamp values based on:
fr: Filtrer les valeurs d'horodatage en fonction de :

source: The "-" character for empty date values:
fr: Le caractère "-" pour les valeurs de date vides :

source: Created at: -
fr: Créé à: -

source: The relative time text, shown in the column (i.e. </i>) </li> <li i18n> The substring of the timestamp, that is shown in the UTC parX months ago</li> <li i18n>)
fr: Le texte de l'heure relative, affiché dans la colonne (c'est-à-dire </i>) </li> <li i18n> La sous-chaîne de l'horodatage, qui s'affiche dans la partie UTCil y a X mois</li> <li i18n>)

source: The substring of the timestamp, that is shown in the UTC part of the tooltip
fr: La sous-chaîne de l'horodatage, qui s'affiche dans la partie UTC de l'info-bulle

source: Select Namespace
fr: Sélectionner l'espace de noms

source: Page 1 of 1
fr: Page 1 de 1

source: Page page + 1 of amountPages
fr: Page page + 1 de amountPages

source: First page
fr: Première page

source: Last page
fr: Dernière page

source: Previous page
fr: Page précédente

source: Next page
fr: Page suivante

source: Items per page:
fr: Objets par page :

source: Filter
fr: Filtrer

source: Enter property name or value
fr: Entrer une valeur ou le nom d'une propriété

source: Clear filters
fr: Effacer les filtres

source: Clear
fr: Effacer

source: Help
fr: Aide

source: No rows to display
fr: Aucune ligne à afficher

source: Namespace
fr: Espace de noms

source: No items
fr: Aucun item

source: Unexpected error encountered
fr: Une erreur inattendue s'est produite

source: An error occurred: error
fr: Une erreur est survenue: error

source: Client error: error.error.message
fr: Erreur client : error.error.message

source: Could not connect to the backend.
fr: Impossible de se connecter à l'infrastructure d'arrière plan.

source: DISMISS
fr: REJETER

source: Select a namespace in which to create a new resourceName.
fr: Sélectionner un espace de noms dasn lequel créer un nouveau resourceName.

source: Miscellaneous Settings
fr: Paramètres divers

source: Enable Shared Memory
fr: Activer la mémoire partagée

source: System Language
fr: Langue du système

source: Affinity / Tolerations
fr: Affinité / Tolérances

source: Affinity Config
fr: Config d'affinité

source: None
fr: Aucun

source: Tolerations Group
fr: Groupe de tolérances

source: CPU / RAM
fr: CPU / Mémoire vive

source: Configure the resources allocated to the notebook. Minimum and maximum values correspond to K8s requests and limits for the resources of the underlying Pod.
fr: Configurez les ressources allouées au bloc-notes. Les valeurs minimales et maximales correspondent aux requêtes K8s et aux limites des ressources du Pod sous-jacent.

source: Requested CPUs
fr: CPU demandés

source: Requested Memory Gi
fr: Mémoire demandées, en Gi

source: Specify number of CPUs
fr: Spécifier le nombre de CPUs

source: Specify at least e.min CPUs
fr: Spécifier au moins e.min CPUs

source: Can't exceed e.max CPUs
fr: Ne peut pas excéder e.max CPUs

source: Can't be lower than requested CPUs
fr: Ne peut pas être moins que les CPUs demandés

source: Specify amount of memory (e.g. 2Gi)
fr: Spécifier la quantité de mémoire (ex. 2Gi)

source: Specify at least e.minGi of memory
fr: Spécifier au moins e.minGi de mémoire

source: Can't exceed e.maxGi of memory
fr: Ne peut pas excéder e.maxGi de mémoire

source: Can't be lower than requested memory
fr: Ne peux pas être moins que la mémoire demandée

source: Data Volumes
fr: Volumes de données

source: Additional volumes that will be mounted in your Notebook.
fr: Les volumes additionels qui seront montés dans votre bloc-notes.

source: Delete volume
fr: Supprimer le volume

source: Show volume details
fr: Montrer les détails du volume

source: Hide volume details
fr: Cacher les détails du volume

source: + Add new volume
fr: + Ajouter un nouveau volume

source: + Attach existing volume
fr: + Attacher un volume existant

source: Number of GPUs
fr: Nombre de GPUs

source: GPU Vendor
fr: Vendeur de GPU

source: Selecting 1 GPU will automatically set 4 CPUs and 96Gi of memory.
fr: La sélection de 1 GPU définira automatiquement 4 CPU et 96Gi de mémoire.

source: There are currently no vendor.uiName GPUs in your cluster.
fr: Il n'y a présentement aucun GPUs de vendor.uiName dans votre cluster.

source: You must also specify the GPU Vendor for the assigned GPUs
fr: Vous devez spécifier le vendeur des GPUs assignés

source: Custom Notebook
fr: Bloc-notes personnalisée

source: OCI Image
fr: Image OCI

source: Please provide an Image to use
fr: Veuillez fournir une image à utiliser

source: Custom Image
fr: Image personnalisée

source: Beta Image
fr: Image bêta

source: A beta notebook server contains upcoming changes to our notebook server images
fr: Un serveur bloc-notes bêta contient les modifications à venir pour nos images de serveur bloc-notes

source: Click <a href="https://github.com/StatCan/zone-kubeflow-containers/compare/master...beta" target="_blank" rel="noopener noreferrer" >here</a > to see the changes in beta
fr: Cliquez <a href="https://github.com/StatCan/zone-kubeflow-containers/compare/master...beta" target="_blank" rel="noopener noreferrer" >ici</a > pour voir les changements dans la version bêta

source: Custom Image
fr: Image personnalisée

source: The selected image will be evaluated against our allow-list. For more details on using your own custom images, follow the documentation at https://github.com/StatCan/aaw-contrib-containers.
fr: L'image sélectionnée sera évaluée par rapport à notre liste autorisée. Pour plus de détails sur l'utilisation de vos propres images personnalisées, suivez la documentation sur https://github.com/StatCan/aaw-contrib-containers.

source: Provide a custom Image
fr: Fournir une image personnalisée

source: Custom image is required
fr: L'image personnalisée est obligatoire

source: urlBeginning is not allowed in URLs
fr: urlBeginning n'est pas permis dans les URLs

source: An interactive development environment for notebooks, code, and data. Ideal for prototyping and experimentation.
fr: Un environnement de développement interactif pour les blocs-notes, le code et les données. Idéal pour le prototypage et l'expérimentation.

source: A SAS image.
fr: Une image SAS.

source: New notebook
fr: Nouveau bloc-notes

source: LAUNCH
fr: LANCER

source: CANCEL
fr: ANNULER

source: No value of the Notebook name was provided
fr: Aucune nom n'a été fournie pour le bloc-notes

source: The form contains invalid fields
fr: Le formulaire contient des champs invalides

source: Submitting new Notebook...
fr: Soumission d'un nouveau bloc-notes...

source: Notebook created successfully.
fr: Bloc-note créé avec succès.

source: Workspace Volume
fr: Volume d'espace de travail

source: Volume that will be mounted in your home directory.
fr: Le volume qui sera monté dans votre directoire maison

source: Mount path
fr: Chemin de monture

source: Check the
fr: Vérifier la

source: K8s docs
fr: documentation K8s

source: for the supported volumes and their specs
fr: pour les volumes soutenus et leurs spécifications

source: Name is required
fr: Nom est obligatoire

source: Is mounted
fr: Est monté

source: Mount path is required
fr: Chemin de monture requis

source: The accepted locations are /home/jovyan, /opt/openmpp and any of their subdirectorie
fr: Les chemins acceptés sont /home/jovyan, /opt/openmpp et leurs sous-répertoires

source: This mount path is already in use
fr: Ce chemin de monture est déjà utilisé

source: Access mode
fr: Mode d'accès

source: Name (suffix)
fr: Nom (suffixe)

source: The cluster will append a random suffix to this name
fr: Le cluster va ajouter un suffixe aléatoire à çe nom

source: The volume name can only contain lowercase alphanumeric characters, '-' or '.', and must start and end with an alphanumeric character
fr: Le nom du volume peut seulement contenir des caractères alphanumériques minuscules, '-' ou '.', et doit commencer et terminer avec un caractère alphanumérique

source: Already mounted
fr: Déjà monté

source: Size in Gi
fr: Taille en Gi

source: Storage class
fr: Classe de stockage

source: Use default class
fr: Utiliser la classe par défaut

source: Class
fr: Classe

source: Empty storage class
fr: Classe de stockage vide

source: No PVCViewer exists for this volume.
fr: Aucun PVCViewer n'existe pour ce volume.

source: PVCViewer is already terminating.
fr: PVCViewer est déjà en cours de terminaison.

source: Close PVCViewer
fr: Fermer PVCViewer

source: PVC is terminating at the moment.
fr: Le PVC est en cours d'arrêt pour le moment.

source: Delete Volume
fr: Supprimer le volume

source: Cannot delete PVC because it is being used by the following notebooks:
fr: Impossible de supprimer le PVC car il est utilisé par les bloc-notes suivants:

source: The PVCViewer is currently starting.
fr: Le PVCViewer est en cours de démarrage.

source: The PVCViewer is currently terminating.
fr: Le PVCViewer est en cours de terminaison.

source: Open PVCViewer
fr: Ouvrir PVCViewer

source: Notebooks
fr: Bloc-notes

source: Name
fr: Nom

source: Created at
fr: Créé à

source: Size
fr: Taille

source: Access Mode
fr: Mode d'accès

source: Storage Class
fr: Classe de stockage

source: Used by
fr: Utilisé par

source: Last activity
fr: Dernière activité

source: Memory
fr: Mémoire

source: Connect to this notebook server
fr: Connecter à ce serveur bloc-notes

source: CONNECT
fr: CONNECTER

source: Stop this notebook server
fr: Arrêter ce serveur bloc-notes

source: Start this notebook server
fr: Démarrer ce serveur bloc-notes

source: Open settings for this notebook server
fr: Ouvrir les paramètres pour ce serveur bloc-notes

source: Storage
fr: Stockage

source: Default Notebook
fr: Bloc-notes par défaut

source: Cost
fr: Coût

source: Approximate cost of notebook server resources - summed values may not match total due to rounding
fr: Approximation du coût des ressources de serveur bloc-notes - la somme des valeurs pourraient être différentes du total du à l'arrondissement

source: Time Window
fr: Fenêtre de temps

source: Today
fr: Aujourd'hui

source: Yesterday
fr: Hier

source: Week-to-date
fr: Semaine à ce jour

source: Month-to-date
fr: Mois à ce jour

source: Last Week
fr: Semaine dernière

source: Last 30 days
fr: Dernier 30 jours

source: Failed to retrieve cost information
fr: Échec de la récupération des informations des coûts

source: New Notebook
fr: Nouveau bloc-notes

source: Add a new notebook
fr: Ajouter un nouveau bloc-notes

source: Notebook
fr: Bloc-notes

source: Preparing to stop the Notebook Server.
fr: Préparation de l'arrêt du serveur bloc-notes.

source: Deleting this Notebook Server.
fr: Serveur bloc-notes en supression.

source: No Pods are currently running for this Notebook Server.
fr: Aucun pod n'est actuellement en cours d'exécution pour ce serveur bloc-notes.

source: Notebook Server is stopping.
fr: Serveur bloc-notes en arrêt.

source: Running
fr: En exécution

source: Waiting for StatefulSet to create the underlying Pod.
fr: En attente du StatefulSet pour créer le Pod sous-jacent.

source: Couldn't find any information for the status of this notebook server.
fr: Aucune information n'a été trouvée sur l'état de ce serveur bloc-notes.

source: An error has occured. Click on the notebook server name for more information.
fr: Une erreur s'est produite. Cliquez sur le nom du serveur bloc-notes pour plus d'informations.

source: Scheduling the Pod.
fr: Planification du Pod.

source: View details
fr: Voir les détails

source: Delete
fr: Supprimer

source: Attached
fr: Attaché

source: Unattached
fr: Libre

source: Volume was submitted successfully.
fr: Le volume a été soumit avec succès

source: JupyterLab based server
fr: Serveur basé sur JupyterLab

source: Rstudio based server
fr: Serveur basé sur Rstudio

source: Ubuntu based server
fr: Serveur basé sur Ubuntu

source: SAS based server
fr: Serveur basé sur SAS

source: No logs were found for this Notebook.
fr: Aucune journalisation n'a été trouvé pour ce bloc-notes.

source: Notebook Pod Logs
fr: Journalisation du pod du bloc-notes

source: Notebook details
fr: Détails du bloc-notes

source: OVERVIEW
fr: APERÇU

source: LOGS
fr: JOURNALISATION

source: EVENTS
fr: ÉVÉNEMENTS

source: Connect to this notebook
fr: Connecter à ce bloc-notes

source: START
fr: DÉMARRER

source: Start this notebook
fr: Démarrer ce bloc-notes

source: STOP
fr: ARRÊT

source: Stop this notebook
fr: Arrêter ce bloc-notes

source: DELETE
fr: SUPPRIMER

source: Delete this notebook
fr: Supprimer ce bloc-notes

source: CLOSE
fr: FERMER

source: No information available about the configuration
fr: Aucune information disponible sur la configuration

source: No volumes available for this notebook.
fr: Aucun volume disponible pour ce bloc-notes.

source: Shared memory enabled
fr: Mémoire partagée activée

source: Notebook creator
fr: Créateur du bloc-notes

source: Requested CPU
fr: CPU demandé

source: Requested memory
fr: Mémoire demandée

source: Environment
fr: Environnement

source: No environment variables available for this notebook.
fr: Aucune variable d'environnement disponible pour ce bloc-notes.

source: No configurations available for this notebook.
fr: Aucune configuration disponible pour ce bloc-notes.

source: Yes
fr: Oui

source: No
fr: Non

source: A PersistentVolumeClaim (PVC) is a request for storage by a user and it is similar to a Pod. Pods consume node resources and PVCs consume PV resources. Pods can request specific levels of resources (CPU and Memory). Claims can request specific size and access modes (e.g., they can be mounted ReadWriteOnce, ReadOnlyMany or ReadWriteMany).
fr: Un PersistentVolumeClaim (PVC) est une demande de stockage par un utilisateur et c'est similaire à un Pod. Les pods consomment des ressources de nœud et les PVC consomment des ressources PV. Les pods peuvent demander des niveaux de ressources spécifiques (CPU et mémoire). Les réclamations peuvent demander une taille et des modes d'accès spécifiques (par exemple, elles peuvent être montées ReadWriteOnce, ReadOnlyMany ou ReadWriteMany).

source: A memory-backed volume is a special kind of emptyDir volume which is mounted as a tmpfs (RAM-backed filesystem) volume. While tmpfs is very fast, be aware that unlike disks, tmpfs is cleared on node reboot and any files you write count against your container's memory limit.
fr: Un volume sauvegardé en mémoire est un type spécial de volume emptyDir qui est monté en tant que volume tmpfs (système de fichiers sauvegardé en RAM). Bien que tmpfs soit très rapide, sachez que contrairement aux disques, tmpfs est effacé au redémarrage du nœud et que tous les fichiers que vous écrivez sont pris en compte dans la limite de mémoire de votre conteneur.

source: An ephemeral volume is Kubernetes emptyDir. An emptyDir volume is first created when a Pod is assigned to a node, and exists as long as that Pod is running on that node. As the name says, the emptyDir volume is initially empty. All containers in the Pod can read and write the same files in the emptyDir volume, though that volume can be mounted at the same or different paths in each container. When a Pod is removed from a node for any reason, the data in the emptyDir is deleted permanently.
fr: Un volume éphémère est Kubernetes emptyDir. Un volume emptyDir est d'abord créé lorsqu'un pod est attribué à un nœud et existe tant que ce pod est exécuté sur ce nœud. Comme son nom l'indique, le volume emptyDir est initialement vide. Tous les conteneurs du pod peuvent lire et écrire les mêmes fichiers dans le volume emptyDir, bien que ce volume puisse être monté sur le même chemin ou sur des chemins différents dans chaque conteneur. Lorsqu'un pod est supprimé d'un nœud pour une raison quelconque, les données dans le emptyDir sont définitivement supprimées.

source: A ConfigMap provides a way to inject configuration data into pods. The data stored in a ConfigMap can be referenced in a volume of type configMap and then consumed by containerized applications running in a pod.
fr: Un ConfigMap fournit un moyen d'injecter des données de configuration dans des pods. Les données stockées dans un ConfigMap peuvent être référencées dans un volume de type configMap puis consommées par des applications conteneurisées s'exécutant dans un pod.

source: A secret volume is used to pass sensitive information, such as passwords, to Pods. You can store secrets in the Kubernetes API and mount them as files for use by pods without coupling to Kubernetes directly. Secret volumes are backed by tmpfs (a RAM-backed filesystem) so they are never written to non-volatile storage.
fr: Un volume secret est utilisé pour transmettre des informations sensibles, telles que des mots de passe, aux pods. Vous pouvez stocker des secrets dans l'API Kubernetes et les monter en tant que fichiers à utiliser par des pods sans couplage direct à Kubernetes. Les volumes secrets sont sauvegardés par tmpfs (un système de fichiers basé sur la RAM) afin qu'ils ne soient jamais écrits sur un stockage non volatile.

source: Notebook CR
fr: CR du bloc-notes

source: Read more at <a [href]="volGroup.url" target="_blank" rel="noopener" class="lib-link" >{{ volGroup.url }}</a >
fr: Lire plus à <a [href]="volGroup.url" target="_blank" rel="noopener" class="lib-link" >{{ volGroup.url }}</a >

source: Notebook
fr: Bloc-notes

source: Show the full YAML of the
fr: Afficher le YAML complet du

source: Pod information is still being loaded.
fr: Les informations sur le pod sont encore en cours de chargement.

source: No pod available for this notebook.
fr: Auncun pod disponible pour ce bloc-notes.

source: No data has been found...
fr: Aucune donnée trouvée...

source: The page you are looking for is not found
fr: La page que vous rechechez est introuvable

source: Access modes
fr: Modes d'accès

source: Size
fr: Taille

source: Volume mode
fr: Mode du volume

source: Volume name
fr: Nom du volume

source: Owned by
fr: Possédé par

source: The pvc is owned by the objects in this list. If all objects in the list get deleted, then the PVC itself will be deleted
fr: Le pvc appartient aux objets de cette liste. Si tous les objets de la liste sont supprimés, le PVC lui-même sera supprimé

source: Used by notebooks
fr: Utilisé par les bloc-notes

source: Pods Mounted
fr: Pods montés

source: No pods are using this PVC.
fr: Aucun pod utilise ce PVC.

source: Failed to fetch mounted pods with error: error
fr: Échec de la récupération des pods montés avec erreur: error

source: Volume details
fr: Détails du volume

source: Can't delete a volume in use
fr: Impossible de supprimer un volume en cours d'utilisation

source: Delete this volume
fr: Supprimer ce volume

source: PVC information is being loaded.
fr: Les informations des PVC sont en cours de chargement.

source: No data has been found.
fr: Aucune donnée trouvée.

source: New Volume
fr: Nouveau volume

source: Create a new empty Volume.
fr: Créer un nouveau volume vide.

source: Volume size in Gi
fr: Taille du volume en Gi

source: Storage Class
fr: Classe de stockage

source: Access Mode
fr: Mode d'accès

source: CREATE
fr: CRÉER

source: CANCEL
fr: ANNULER

source: Delete request was sent.
fr: La demande de suppression a été envoyée.

source: Error err
fr: Erreur err

source: Starting Notebook server 'name'...
fr: Démarrage le serveur bloc-notes 'name'...

source: Stopping Notebook server 'name'...
fr: Arrêt du serveur bloc-notes 'name'...

source: Are you sure you want to delete this volume? name
fr: Êtes-vous sûr que vous voulez supprimer ce volume? name

source: Warning: All data in this volume will be lost.
fr: Avertissement: Toutes données dans ce volume seront perdues.

source: CANCEL
fr: ANNULER

source: DELETING
fr: SUPPRESSION

source: Are you sure you want to delete this notebook server? name
fr: Êtes-vous sûr que vous voulez supprimer ce serveur bloc-notes? name

source: Warning: Your data might be lost if the notebook server is not backed by persistent storage
fr: Avertissement: Vos données pourraient disparaître si le serveur bloc-notes n'est pas soutenu par un stockage persistant

source: Are you sure you want to stop this notebook server? name
fr: Êtes-vous sûr que vous voulez arrêter ce serveur bloc-notes? name

source: STOPPING
fr: ARRÊT

source: Existing volume
fr: Volume existant

source: New volume
fr: Nouveau volume

source: Custom (Advanced)
fr: Personnalisée (Avancée)
